{"about-magda":"Operations Manager","about-maria":"President/Co-Founder","about-para-1":"EdTechQuity traces its roots to a deeply personal journey, one intertwined with the unwavering belief and support of a remarkable woman, Maria Elena Medrano. Affectionately known as \"Ma\" to her kids and Cuata to her family. Maria Elena played a pivotal role in the birth of EdTechQuity. Serving as a guiding force, her qualities of resiliency, determination, and boundless encouragement inspires our mission. ","about-para-2":"Maria Elena's life story began in the face of adversity; orphaned at the age of three, she navigated life's challenges with grace and strength. Despite the hurdles, she grew into a woman of remarkable character. At the age of 16, Maria Elena embraced motherhood, becoming a parent to her oldest and only daughter, Maria Medrano. 3 more children soon followed, and Maria Elena went above and beyond in her role as a source of unwavering support for her children. Maria Elena sadly passed away in November 2021, but her spirit continues to support her family. ","about-para-3":"Throughout her life, Maria Elena embodied the spirit of possibility. She instilled in her children the belief that any dream could be achieved through education, determination, and resiliency. Even when uncertainties loomed, Maria Elena's consistent message echoed – \"You can become whatever you want to become, and I'll always be here to support you.\" ","about-para-4":"To expand on Maria Elena's profound influence, EdTechQuity was created by Maria Medrano with a singular vision – to eradicate generational poverty through educational achievement. Established as a 501(c)(3) nonprofit organization, EdTechQuity focuses on improving completion rates for low-income students pursuing business certificates or college degrees, with a special emphasis on Latina students. \n","about-para-5":"\nA centerpiece of EdTechQuity's initiatives is the Young Lady Latina +1 Empowerment Summit 2024, a groundbreaking event in the Sacramento Valley tailored for young Latinas aged 16-23 to find their own determination and resilience. This summit goes beyond a traditional conference; it represents a transformative experience. Participants, accompanied by their chosen \"+1\" advocates, engage in empowerment sessions designed to inspire, equip, and prepare young Latina women for a brighter future for themselves and future generations. Microscholarships offered through the summit provide additional support for their educational journey. ","about-para-6":"The ethos of EdTechQuity reflects Maria Elena's commitment to community and support. “Ma” was often her daughter’s +1, advocating and supporting her growth. Recognizing that empowerment extends beyond the individual, the summit encourages participants to bring someone to advocate for them. Whether a family member, teacher, or mentor, this inclusive approach strengthens the support system for young women and engages the broader community in fostering an environment conducive to their success and growth. ","about-para-7":"EdTechQuity, born out of Maria Elena's legacy, stands as a living tribute to her enduring impact. Through the organization's initiatives and the Young Lady Latina +1 Empowerment Summit, the spirit of guidance, motivation, and unconditional support that Maria Elena exemplified continues to shape the lives of aspiring individuals, echoing the timeless message that with education, technology, and equity, transformative possibilities are within reach. ","about-team":"Our Team","about-title":"Who we are","memorial-para":"You will always shine brilliantly in our hearts. We will continue to carry with us your wisdom: to improve the lives of others, and always lead with intention.","memorial-thank-you":"Thank You"}