{"about-magda":"Operations Manager","about-maria":"President/Co-Founder","about-para-1":"EdTechQuity traces its roots to a deeply personal journey, one intertwined with the\nunwavering belief and support of a remarkable woman, Maria Elena Medrano.\nAffectionately known as \"Ma,\" Maria Elena played a pivotal role as a guiding force,\nshaping the foundation of resilience, determination, and boundless encouragement that\ninspired the inception of EdTechQuity.","about-para-2":"Maria Elena's life story began in the face of adversity; orphaned at the tender age of\nthree, she navigated life's challenges with grace and strength. Despite the hurdles, she\ngrew into a woman of remarkable character. At the age of 16, Maria Elena embraced\nmotherhood, becoming not only a parent to 4 children but a source of unwavering\nsupport for her oldest and only daughter, Maria Medrano. Maria Elena sadly passed\naway in November, 2021 and her spirit continues to support her daughter.","about-para-3":"Throughout Maria Medrano's life, Maria Elena embodied the spirit of possibility. She\ninstilled in her daughter the belief that any dream could be achieved through education,\ndetermination, and resilience. “Ma” was Maria Medrano’s +1 who advocated and\nsupported her daughter’s growth. Even when uncertainties loomed, Maria Elena's\nconsistent message echoed – \"You can become whatever you want to become, and I'll\nalways be here to support you.\"","about-para-4":"To expand to Maria Elena's profound influence, EdTechQuity was\ncreated by Maria Madrano with a singular vision – to eradicate generational\npoverty through educational achievement. Established as a 501(c)(3) nonprofit\norganization, EdTechQuity focuses on improving completion rates for low-income\nstudents pursuing business certificates or college degrees, with a special emphasis on\nLatina students.","about-para-5":"A centerpiece of EdTechQuity's initiatives is the Young Lady Latina +1 Empowerment\nSummit 2024, a groundbreaking event in the Sacramento Valley tailored for young\nLatinas aged 16-23 to find their own determination and resilience. This summit goes\nbeyond a traditional conference; it represents a transformative experience. Participants,\naccompanied by their chosen \"+1\" advocates, engage in empowerment sessions\ndesigned to inspire, equip, and prepare young Latina women for a brighter future\nfor themselves and future generations. Microscholarships offered through the summit\nprovide additional support for their educational journey.","about-para-6":"The ethos of EdTechQuity reflects Maria Elena's commitment to community and\nsupport. Recognizing that empowerment extends beyond the individual, the summit\nencourages participants to bring someone to advocate for them. Whether a family\nmember, teacher, or mentor, this inclusive approach strengthens the support system for\nyoung women and engages the broader community in fostering an environment\nconducive to their success and growth.","about-para-7":"EdTechQuity, born out of Maria Elena's legacy, stands as a living tribute to her enduring\nimpact. Through the organization's initiatives and the Young Lady Latina +1\nEmpowerment Summit, the spirit of guidance, motivation, and unconditional support that Maria Elena exemplified continues to shape the lives of aspiring individuals, echoing the\ntimeless message that with education, technology, and equity, transformative\npossibilities are within reach.","about-team":"Our Team","about-title":"Who we are","memorial-para":"You will always shine brilliantly in our hearts. We will continue to carry with us your wisdom: to improve the lives of others, and always lead with intention.","memorial-thank-you":"Thank You"}