{"button-hero":"Learn More","Help-1-card-des-1":"Create an equitable educational landscape.","Help-1-card-des-2":"Seamlessly connect non-profits, schools, and workplaces.","Help-1-card-des-3":"Ensure every student has access to tools and resources for success.","Help-1-card-liste-1":"Create an equitable educational landscape.\nSeamlessly connect non-profits, schools, and workplaces.\nEnsure every student has access to tools and resources for success.","Help-1-card-paragraph":"Our initiative actively narrows the digital divide, providing equitable tech access to foster a connected, empowered future for all learners.","Help-1-card-title":"Bridge the Digital Divide","Help-2-card-des-1":"Recognize regional workforce shortages.","Help-2-card-des-2":"Actively curate and distribute content tailored to address these gaps.","Help-2-card-des-3":"Align education with the needs of the workforce.","Help-2-card-des-4":"Empower students with knowledge and skills for success.","Help-2-card-paragraph":"We focus on curating and disseminating educational content, ensuring every learner engages with material that enlightens and inspires.","Help-2-card-title":"Curate and Distribute Content","Help-3-card-des-1":"Address financial barriers faced by students.","Help-3-card-des-2":"Provide immediate micro scholarships.","Help-3-card-des-3":"Strategically designed to increase access to higher education.","Help-3-card-des-4":"Enable students to pursue academic and professional aspirations.","Help-3-card-paragraph":"Our micro-scholarships offer vital support, making education accessible and dreams achievable for aspiring students.","Help-3-card-title":"Micro Scholarships","Help-subtitle":"Empowering Futures, Bridging Divides: Innovating Education with Technology","Help-title":"How We Help ?","Hero-subtitle-1":"Empowering the Next Generation of Latina.","Hero-subtitle-2":"Join us on Saturday, May 4, 2024, for a transformative experience.","Hero-title":"Young Lady Latina +1 \n\n","hero-title-2":"Empowerment Summit 2024","intro-paragraph-1":"EdTechQuity helps power Inspirame as a 501(c)(3) nonprofit organization with the mission of increasing the number of low-income students who complete a trade, certificate, or college degree.","intro-paragraph-2":"Our mission is to increase the 2% of Latinas who graduate from community college in 2 years, and give them the insights, motivation, and ganas to break the cycles of poverty within their families.","intro-subtitle":"Powering Inspirame to help end generational poverty through educational attainment","problem-1-card":"of Latinx CCC students will take more than 4-years to transfer to a university","problem-1-paragraph":"Our nation's post-secondary education system is riddled with confusing processes, an overwhelming amount of choices, educational paths that differ between universities, and a significant lack of student support.","problem-2-card":"of Black CCC students will take more than 4-years to transfer to a university","problem-2-paragraph":"Furthermore, the students who enter college do not receive the support or resources necessary to persist in a system that wasn't built for them, all coming together to ensure that only:","problem-3-card":"of Latinx males who transfer to a university, will take more than 2-years to complete their bachelor’s degree at a CSU","problem-4-card":"of Black HS graduates will not meet admission requirements for UC or CSU","problem-title":"The Complexity in Post-Secondary Educational Choices and Support","problem-title-word":"Navigate the Maze:","title-sponsor":" With the support of","Young-latina-button":"Learn More","Young-latina-date":"May 4, 2024","Young-latina-para-1":"In collaboration with Inspirame, we are thrilled to present our first-ever event, the Young Lady Latina +1 Empowerment Summit 2024. This extraordinary conference, specifically tailored for young Latina ladies aged 16-23 in the Sacramento Valley, marks a significant milestone in our journey towards making impactful societal changes.","Young-latina-para-2":"Join us in a transformative gathering dedicated to inspiring and equipping young Latina women for a future filled with opportunities.","Young-latina-subtitle":"Empowering the Next Generation of Latina","Young-latina-title-1":"Young Lady Latina + 1","Young-latina-title-2":"Empowerment Summit 2024"}