{"button-join":"Join The Waiting List","counter-attend":"Attendees (total 300)","counter-edition":"Edition","counter-event":"Event","counter-speakers":"Speakers","event-feat-1-para":"The Young Lady Latina Empowerment Summit shines a spotlight on inspirational Latina leaders who have carved paths in their respective fields. These are women who have turned obstacles into stepping stones, breaking barriers in industries where Latina voices are often underrepresented. As they share their journeys of resilience and success, their stories will not just be heard; they will resonate deeply, igniting a fire of ambition and passion within you.","event-feat-1-subtitle":"Empowerment Through Leadership:","event-feat-1-title":"Inspirational Latina Leaders","event-feat-2-para":"Networking at the Young Lady Latina Empowerment Summit goes beyond exchanging business cards. It's about forging meaningful connections with peers, mentors, and professionals who share your aspirations and drive. This is your platform to meet individuals who can influence your journey positively, offering guidance, opportunities, and support.","event-feat-2-subtitle":"Building Meaningful Connections:","event-feat-2-title":"Networking with Purpose","event-feat-3-para":"Each workshop is a building block in your personal and professional development. Whether it's learning how to manage finances, understanding the nuances of tech industries, or advocating for your education, these sessions equip you with the tools and knowledge you need to succeed in today's competitive world.","event-feat-3-subtitle":"Tools for Tomorrow's Leaders:","event-feat-3-title":"Empowerment Workshops","event-feat-4-para":"The Young Lady Latina Empowerment Summit is a celebration of culture and heritage. It's a day where you can embrace and showcase your cultural identity through vibrant activities and expressions. This celebration acknowledges the richness and diversity of Latina heritage, offering a space where your identity is not just seen but celebrated with pride.","event-feat-4-subtitle":"Embracing Cultural Richness:","event-feat-4-title":"Cultural Celebration","event-feat-5-para":"Opening Doors to Education: At the heart of the summit lies the opportunity to learn about and access exclusive micro-scholarships. These scholarships are more than financial aid; they are doors opening to new educational prospects, supporting your academic journey and professional aspirations.","event-feat-5-subtitle":"Opening Doors to Education:","event-feat-5-title":"Micro-Scholarship Opportunities","event-feat-6-para":"Unique to the Young Lady Latina Empowerment Summit is the opportunity for every participant to bring a +1 — someone who believes in and supports their potential. This could be a family member, a mentor, a friend, or anyone who has been a pillar in your journey. This aspect of the summit acknowledges the importance of a supportive network in personal and professional growth.","event-feat-6-subtitle":"A Circle of Support:","event-feat-6-title":"Supportive Community","summit-date":"May 4, 2024","summit-eligibility-app-para-1":"Submission Requirements: A personal expression piece (2-3 minute video, audio, or written).","summit-eligibility-app-para-2":"Content of Submission: Outline personal story and motivation for participation.","summit-eligibility-app-title":"Application Process","summit-eligibility-commu-para-1":"Focus on equipping the plus-one community members for better support and workforce development.","summit-eligibility-commu-title":"Community and Empowerment","summit-eligibility-subtitle":"Guiding Your Journey: From Application to Participation","summit-eligibility-support-para-1":"Preparatory sessions available for application assistance.","summit-eligibility-support-para-2":"Inclusive of Plus-One Community: Each applicant can invite a supportive individual.","summit-eligibility-support-title":"Support for Applicants","summit-eligibility-target":"Target Audience","summit-eligibility-target-para":"If you are  a Latina aged 16-23, an ESL learner in the Sacramento Valley facing educational challenges, and feel like you at risk or discouraged from school, this summit is for you.","summit-eligibility-title":" Participant Eligibility and Application Process","summit-get-ready-title":" Get Ready for ETQ Summit 2024","summit-intro-para-1":" Join us in a transformative gathering dedicated to inspiring and equipping young Latina women for a future filled with opportunities. This unique summit, a collaborative effort between EdTechQuity and \nInspirame , is designed to empower young Latinas aged 16-23 in the Sacramento Valley.","summit-intro-para-2":"Discover a day of inspiration, learning, and networking.Participants will have the unique opportunity to bring along a supporter - be it a family member, teacher, or mentor - who believes in their potential and is committed to their journey of growth and success.","summit-sponsor":"With the support of","summit-subtitle":"Empowering the Next Generation of Latina","summit-subtitle-intro":"Inspiring Growth and Success for the Next Generation","summit-title-1":"Young Lady Latina","summit-title-2":"Empowerment Summit +1","summit-title-intro":"Paving the Way for Young Latina Trailblazers","summit-why-attend-para":"As a participant of the Young Lady Latina Empowerment Summit, you are not just attending another event; you are stepping into a realm of inspiration, education, and empowerment specifically tailored for young Latina women. \nHere’s why this summit is unmissable:","summit-why-attend-subtitle":"Unlock Your Potential: A Gateway to Growth and Opportunities","summit-why-attend-title":" Why Attend Young Latina Empowerment Summit +1?"}