{"about-magda":"Gerente de Operaciones","about-maria":"Presidente/Cofundador","about-para-1":"EdTechQuity tiene sus raíces en un viaje profundamente personal, entrelazado con la creencia y el apoyo inquebrantables de una mujer extraordinaria, María Elena Medrano. Conocida cariñosamente como \"Ma\" por sus hijos y Cuata por su familia. María Elena jugó un papel fundamental en el nacimiento de EdTechQuity. Al servir como fuerza guía, sus cualidades de resiliencia, determinación y aliento ilimitado inspiran nuestra misión. ","about-para-2":"La historia de vida de María Elena comenzó ante la adversidad; Quedó huérfana a la edad de tres años y afrontó los desafíos de la vida con gracia y fuerza. A pesar de los obstáculos, se convirtió en una mujer de carácter extraordinario. A la edad de 16 años, María Elena abrazó la maternidad y se convirtió en madre de su única y mayor hija, María Medrano. Pronto le siguieron 3 hijos más, y María Elena hizo todo lo posible en su papel de fuente de apoyo inquebrantable para sus hijos. María Elena lamentablemente falleció en noviembre de 2021, pero su espíritu continúa apoyando a su familia. ","about-para-3":"A lo largo de su vida, María Elena encarnó el espíritu de posibilidad. Inculcó a sus hijos la creencia de que cualquier sueño se puede lograr mediante educación, determinación y resiliencia. Incluso cuando surgían incertidumbres, el constante mensaje de María Elena resonó: \"Puedes convertirte en lo que quieras y siempre estaré aquí para apoyarte\". ","about-para-4":"Para ampliar la profunda influencia de María Elena, María Medrano creó EdTechQuity con una visión singular: erradicar la pobreza generacional a través del logro educativo. Establecida como una organización sin fines de lucro 501(c)(3), EdTechQuity se enfoca en mejorar las tasas de finalización de estudiantes de bajos ingresos que obtienen certificados de negocios o títulos universitarios, con especial énfasis en las estudiantes latinas. \n","about-para-5":"\nUna pieza central de las iniciativas de EdTechQuity es la Cumbre de Empoderamiento Young Lady Latina +1 2024, un evento innovador en el Valle de Sacramento diseñado para jóvenes latinas de entre 16 y 23 años para encontrar su propia determinación y resiliencia. Esta cumbre va más allá de una conferencia tradicional; representa una experiencia transformadora. Los participantes, acompañados por sus defensores \"+1\" elegidos, participan en sesiones de empoderamiento diseñadas para inspirar, equipar y preparar a las jóvenes latinas para un futuro mejor para ellas y las generaciones futuras. Las microbecas ofrecidas a través de la cumbre brindan apoyo adicional para su viaje educativo. ","about-para-6":"El espíritu de EdTechQuity refleja el compromiso de María Elena con la comunidad y el apoyo. “Ma” era a menudo la +1 de su hija, defendiendo y apoyando su crecimiento. Al reconocer que el empoderamiento se extiende más allá del individuo, la cumbre alienta a los participantes a traer a alguien que los defienda. Ya sea un miembro de la familia, un maestro o un mentor, este enfoque inclusivo fortalece el sistema de apoyo para las mujeres jóvenes e involucra a la comunidad en general en el fomento de un entorno propicio para su éxito y crecimiento. ","about-para-7":"EdTechQuity, nacida del legado de María Elena, es un tributo vivo a su impacto duradero. A través de las iniciativas de la organización y la Cumbre de Empoderamiento Young Lady Latina +1, el espíritu de orientación, motivación y apoyo incondicional que ejemplificó María Elena continúa moldeando las vidas de las personas aspirantes, haciéndose eco del mensaje atemporal de que con educación, tecnología y equidad, Las posibilidades transformadoras están a nuestro alcance. ","about-team":"Nuestro equipo","about-title":"Quienes somos","memorial-para":"Siempre brillarás intensamente en nuestros corazones. Continuaremos llevando con nosotros tu sabiduría: mejorar la vida de los demás y liderar siempre con intención.","memorial-thank-you":"Gracias"}