{"button-hero":"Aprende más","Help-1-card-des-1":"Crear un panorama educativo equitativo.","Help-1-card-des-2":"Conecte sin problemas organizaciones sin fines de lucro, escuelas y lugares de trabajo.","Help-1-card-des-3":"Asegúrese de que cada estudiante tenga acceso a herramientas y recursos para el éxito.","Help-1-card-liste-1":"Crear un panorama educativo equitativo. Conecte sin problemas organizaciones sin fines de lucro, escuelas y lugares de trabajo. Asegúrese de que cada estudiante tenga acceso a herramientas y recursos para el éxito.","Help-1-card-paragraph":"Nuestra iniciativa reduce activamente la brecha digital, brindando acceso equitativo a la tecnología para fomentar un futuro conectado y empoderado para todos los estudiantes.","Help-1-card-title":"Cerrar la brecha digital","Help-2-card-des-1":"Reconocer la escasez de mano de obra regional.","Help-2-card-des-2":"Seleccione y distribuya activamente contenido diseñado para abordar estas brechas.","Help-2-card-des-3":"Alinear la educación con las necesidades de la fuerza laboral.","Help-2-card-des-4":"Capacite a los estudiantes con conocimientos y habilidades para el éxito.","Help-2-card-paragraph":"Nos centramos en seleccionar y difundir contenido educativo, garantizando que cada alumno interactúe con material que esclarezca e inspire.","Help-2-card-title":"Curar y distribuir contenido","Help-3-card-des-1":"Abordar las barreras financieras que enfrentan los estudiantes.","Help-3-card-des-2":"Proporcionar microbecas inmediatas.","Help-3-card-des-3":"Diseñado estratégicamente para incrementar el acceso a la educación superior.","Help-3-card-des-4":"Permitir a los estudiantes perseguir aspiraciones académicas y profesionales.","Help-3-card-paragraph":"Nuestras microbecas ofrecen un apoyo vital, haciendo que la educación sea accesible y los sueños alcanzables para los aspirantes a estudiantes.","Help-3-card-title":"Microbecas","Help-subtitle":"La exposición es clave para un futuro más brillante en el que se construyen puentes para acelerar aún más el aprendizaje. ","Help-title":"¿Cómo ayudamos?","Hero-subtitle-1":"Empoderando a la próxima generación de latinas.","Hero-subtitle-2":"Únase a nosotros el sábado 28 de septiembre de 2025 para vivir una experiencia transformadora.","Hero-title":"jovencita latina \n\n","hero-title-2":"Cumbre de Empoderamiento +1 2025","intro-paragraph-1":"\nEdTechQuity ayuda a impulsar a Inspirame como una organización sin fines de lucro 501(c)(3) a través de contenido culturalmente relevante, oradores y más. Tenemos la misión de aumentar la cantidad de estudiantes de bajos ingresos que completan una carrera profesional, un certificado o un título universitario. Esto comienza exponiéndolos a las posibilidades de lo que les espera en la educación superior a través de asociaciones con distritos escolares y otras organizaciones sin fines de lucro. \n","intro-paragraph-2":"Nuestra misión es aumentar la cantidad de personas que se gradúan de los colegios comunitarios mostrando las experiencias que les esperan allí. Estamos comprometidos a aumentar la cantidad de estudiantes que se inscriben, se transfieren y se gradúan. En EdTechQuity, haremos nuestra parte para exponer a más jóvenes al poder de la educación y la tecnología, todo con un enfoque equitativo. Es lo mínimo que podemos hacer. \n","intro-subtitle":"Juntos, podemos ayudar a acabar con la pobreza generacional a través de oportunidades educativas para todos.","problem-1-card":"de los estudiantes Latinx CCC tardarán más de 4 años en transferirse a una universidad","problem-1-paragraph":"El sistema de educación postsecundaria de nuestra nación está plagado de procesos confusos, una cantidad abrumadora de opciones, caminos educativos que difieren entre universidades y una falta significativa de apoyo a los estudiantes.","problem-2-card":"de los estudiantes negros de CCC tardarán más de 4 años en transferirse a una universidad","problem-2-paragraph":"Además, los estudiantes que ingresan a la universidad no reciben el apoyo ni los recursos necesarios para persistir en un sistema que no fue creado para ellos, y todos se unen para garantizar que solo:","problem-3-card":"de los hombres latinos que se transfieren a una universidad tardarán más de 2 años en completar su licenciatura en una CSU","problem-4-card":"de los graduados negros de HS no cumplirán con los requisitos de admisión para UC o CSU","problem-title":"Opciones y apoyo para la educación postsecundaria\n","problem-title-word":"Navega por el laberinto:","title-sponsor":" Con el apoyo de","Young-latina-button":"Aprende más","Young-latina-date":"28 de septiembre de 2025","Young-latina-para-1":"En colaboración con Inspirame, estamos encantados de presentar nuestro primer evento, la Cumbre de Empoderamiento de Mujeres Latinas Jóvenes +1 2025. Esta extraordinaria conferencia, diseñada específicamente para mujeres latinas jóvenes de entre 16 y 23 años en el Valle de Sacramento, marca un hito importante en nuestro camino hacia la realización de cambios sociales impactantes.","Young-latina-para-2":"Únase a nosotros en una reunión transformadora dedicada a inspirar y equipar a jóvenes latinas para un futuro lleno de oportunidades.","Young-latina-subtitle":"Empoderando a la próxima generación de latinas","Young-latina-title-1":"jovencita latina ","Young-latina-title-2":"+ 1 Cumbre de Empoderamiento 2025"}