{"button-join":"Únase a la lista de espera","summit-date":"4 de mayo de 2024","counter-event":"Evento","counter-attend":"Asistentes (total 300)","summit-sponsor":"Con el apoyo de","summit-title-1":"jovencita latina ","summit-title-2":"+1 Cumbre de Empoderamiento 2024","counter-edition":"Edición","summit-subtitle":"Empoderando a la próxima generación de latinas","counter-speakers":"Altavoces","event-feat-1-para":"La Cumbre de Empoderamiento de las Jóvenes Latinas destaca a líderes latinas inspiradoras que se han abierto camino en sus respectivos campos. Estas son mujeres que han convertido los obstáculos en peldaños, rompiendo barreras en industrias donde las voces latinas a menudo están subrepresentadas. Mientras comparten sus viajes de resiliencia y éxito, sus historias no sólo serán escuchadas; resonarán profundamente, encendiendo un fuego de ambición y pasión dentro de ti.","event-feat-2-para":"El networking en la Cumbre de Empoderamiento de las Jóvenes Latinas va más allá del intercambio de tarjetas de presentación; también abarca conectarse a través de las redes sociales, reconociendo el papel fundamental que desempeñan en la forma en que esta generación interactúa y mantiene relaciones. Se trata de forjar conexiones significativas con compañeros, mentores y profesionales que comparten sus aspiraciones e impulso. Esta es su plataforma para conocer personas que pueden influir positivamente en su viaje, ofreciendo orientación, oportunidades y apoyo, ya sea a través de un apretón de manos tradicional o un seguimiento digital.","event-feat-3-para":"Cada taller es una pieza fundamental en su desarrollo personal y profesional. Ya sea que se trate de aprender a administrar las finanzas, comprender los matices de las industrias tecnológicas o defender su educación, estas sesiones lo brindarán con las herramientas y el conocimiento que necesita para tener éxito en el mundo competitivo de hoy.","event-feat-4-para":"La Cumbre de Empoderamiento de las Jóvenes Latinas es una celebración de la cultura y el patrimonio. Es un día en el que puedes abrazar y mostrar tu identidad cultural a través de actividades y expresiones vibrantes. Esta celebración reconoce la riqueza y diversidad de la herencia latina, ofreciendo un espacio donde su identidad no sólo se ve sino que se celebra con orgullo.","event-feat-5-para":"Abriendo Puertas a la Educación: En el corazón de la cumbre se encuentra la oportunidad de conocer y acceder a microbecas exclusivas. Estas becas son más que ayuda financiera; son puertas que se abren a nuevas perspectivas educativas, apoyando su trayectoria académica y sus aspiraciones profesionales.","event-feat-6-para":"Una característica exclusiva de la Cumbre de Empoderamiento de Young Lady Latina es la oportunidad para que cada participante traiga un +1: alguien que cree en su potencial y lo apoya. Podría ser un familiar, un mentor, un amigo o cualquier persona que haya sido un pilar en su viaje. Este aspecto de la cumbre reconoce la importancia de una red de apoyo en el crecimiento personal y profesional.","event-feat-1-title":"Líderes latinas inspiradoras","event-feat-2-title":"Establecimiento de redes con propósito","event-feat-3-title":"Talleres de empoderamiento","event-feat-4-title":"Celebración Cultural","event-feat-5-title":"Oportunidades de microbecas","event-feat-6-title":"Comunidad de apoyo","summit-title-intro":"Allanando el camino para las jóvenes latinas pioneras","summit-intro-para-1":" Únase a nosotros en una reunión transformadora dedicada a inspirar y equipar a jóvenes latinas para un futuro lleno de oportunidades. Esta cumbre única, un esfuerzo de colaboración entre EdTechQuity e Inspirame, está diseñada para empoderar a las jóvenes latinas de entre 16 y 23 años en el Valle de Sacramento.","summit-intro-para-2":"Descubra un día de inspiración, aprendizaje y networking. Los participantes tendrán la oportunidad única de contar con un apoyo (ya sea un familiar, un maestro o un mentor) que crea en su potencial y esté comprometido con su viaje de crecimiento y éxito.","event-feat-1-subtitle":"Empoderamiento a través del liderazgo:","event-feat-2-subtitle":"Construyendo conexiones significativas:","event-feat-3-subtitle":"Herramientas para los líderes del mañana:","event-feat-4-subtitle":"Abrazar la riqueza cultural:","event-feat-5-subtitle":"Abriendo puertas a la educación:","event-feat-6-subtitle":"Un círculo de apoyo:","summit-subtitle-intro":"Inspirando crecimiento y éxito para la próxima generación","summit-get-ready-title":" Prepárese para la Cumbre ETQ 2024","summit-why-attend-para":"Como participante de la Cumbre de Empoderamiento Young Lady Latina +1 2024, no estás asistiendo simplemente a otro evento; estás entrando en un reino de inspiración, educación y empoderamiento diseñado específicamente para mujeres jóvenes latinas. He aquí por qué esta cumbre es imperdible:","summit-why-attend-title":" ¿Por qué asistir a la Cumbre de Empoderamiento de Jóvenes Latinas +1 2024?","summit-eligibility-title":" Elegibilidad de los participantes y proceso de solicitud","summit-eligibility-target":"Público objetivo","summit-why-attend-subtitle":"Libere su potencial: una puerta de entrada al crecimiento y las oportunidades","summit-eligibility-subtitle":"Guiando su viaje: de la solicitud a la participación","summit-eligibility-app-title":"Proceso de solicitud","summit-eligibility-app-para-1":"Requisitos de envío: Una pieza de expresión personal (video, audio o escrito de 2 a 3 minutos).","summit-eligibility-app-para-2":"Contenido de la presentación: Resuma la historia personal y la motivación para participar.","summit-eligibility-commu-title":"Comunidad y empoderamiento","summit-eligibility-target-para":"Si es una latina de entre 16 y 23 años, una estudiante de ESL en el Valle de Sacramento que enfrenta desafíos educativos y se siente en riesgo o desanimada de ir a la escuela, esta cumbre es para usted.","summit-eligibility-commu-para-1":"Concéntrese en equipar a los miembros más uno de la comunidad para un mejor apoyo y desarrollo de la fuerza laboral.","summit-eligibility-support-title":"Apoyo a los solicitantes","summit-eligibility-support-para-1":"Sesiones preparatorias disponibles para asistencia con la solicitud.","summit-eligibility-support-para-2":"Inclusivo de la comunidad Plus-One: cada solicitante puede invitar a una persona que lo apoye."}